app/Libraries/Systems/AuthAccess.php

SELECT `can_create`, `can_read`, `can_update`, `can_delete`
FROM `auth_groups_menus`
WHERE `group_id` = '1'
AND `menu_id` = '2'
---
   public function getAuthAccessMenuByUser()
   {
      $user     = auth()->user();
      $group_id = session()->has('group_id') ? decrypt_text(session()->get('group_id')) : 0;
      $menu_id  = session()->has('active_menu_id') ? decrypt_text(session()->get('active_menu_id')) : 0;

      if ($user->inGroup($group_id)) {
         return $this->GroupsMenusModel->select('can_create, can_read, can_update, can_delete')->where('group_id', $group_id)->where('menu_id', $menu_id)->get()->getResultArray();

SELECT `group`
FROM `auth_groups_users`
WHERE `user_id` = 2
AND `is_default` = 1
SELECT `title`
FROM `auth_groups`
WHERE `id` = '1'
---
   public function getAuthAccessMenuByGroup()
   {
      $group_id = config('AuthGroups')->defaultGroup;
      $user     = auth()->user();

      if (session()->has('group_id') && intval(decrypt_text(session()->get('group_id'))) > 0) {
         $group_id    = decrypt_text(session()->get('group_id'));
      } else {
         $data = $this->GroupsUsersModel->select('group')->where('user_id', auth()->id())->where('is_default', 1)->get()->getFirstRow('array');

         if ($data !== null) {
            $group_id = $data['group'];
         }
         session()->set('group_id', encrypt_text($group_id));
      }

      $groups = $this->groupsModel->select('title')->where('id', $group_id)->get()->getFirstRow('array');