app/Models/Systems/MenusModel.php

SELECT `b`.`id`, `a`.`parent_menu_id` AS `parent_id`, `b`.`name`, `b`.`modules`, `b`.`routes`, `b`.`icons`, `a`.`order`, `a`.`visibility` AS `is_hidden`
FROM `auth_groups_menus` `a`
LEFT JOIN `menus` `b` ON `a`.`menu_id` = `b`.`id`
WHERE `a`.`group_id` = '1'
AND `b`.`status_cd` = 'active'
AND `a`.`visibility` = 1
ORDER BY `a`.`order` ASC
---
	public function GroupMenu($group_id)
	{
		return $this->builder('auth_groups_menus a')
			->select('b.id,
					a.parent_menu_id AS parent_id,
					b.name,
					b.modules,
					b.routes,
					b.icons,
					a.order,
					a.visibility AS is_hidden')
			->join('menus b', 'a.menu_id = b.id', 'left', true)
			->where('a.group_id', $group_id)
			->where('b.status_cd', 'active')
			->where('a.visibility', 1)
			->orderBy('a.order', 'asc')
			->get()
			->getResultArray();